{
    "juan": {
        "color": "Juan",
        "name": "Juan Escalada",
        "about": "I’m a technology enthusiast exploring different paths in the software industry. My favourite topics are: Game development, VR, Systems Architecture and Backend development. I have worked with various tools including: Javascript (Node, Express, EJS, socket.io, passport.js), Python (Discord API, numpy, matplotlib), C# scripting in Unity, SQL (MySQL, AWS Redis) and NoSQL databases (MongoDB, Firestore). I’m hoping to learn many more over the course of my career, and collaborate to make amazing projects together!",
        "hobbies": [{"hobbyName": "Exercising", "hobbyDesc": "The hobby that I enjoy the most is exercising. I have been training for the last 4 years, I started with weight-lifting, then I began long-distance running, and these days I do both! I train every day after work, and I find it helps me relax after a long day of coding."}, {"hobbyName": "Japanese", "hobbyDesc": "I am a huge fan of Japanese culture, but my favourite thing about them is their language! It’s an intricate language that takes a lifetime to master. I have been studying Japanese on my own for 7 years now, and I can speak fluently with my friends. I can read simple things like manga as well."}, {"hobbyName": "Piano", "hobbyDesc": "I started playing the piano when I was 9, although, to be completely fair, I stopped practicing so much after I graduated high-school. Music has always been a big part of my life though, and I find myself applying musical concepts in the soundtracks of the games I develop."}, {"hobbyName": "Game Development", "hobbyDesc": "As a kid, I loved making games in pen and paper and playing alone or with friends. Eventually, this led me to making a few simple terminal-based games in Java, and finally using Unity to make the game development process a lot quicker! I’ve even deployed one of my games on the Google Play Store!"}],
        "experience": [{"expName": "British Columbia Institute of Technology", "expDesc": "I’m a Computer Systems Technology student at BCIT, in Vancouver. BCIT is a Technical School that emphasizes practical knowledge over theory. Here I’m learning a lot about collaboration, Agile development, Test-driven development, software best practices and many other things that regular universities usually don’t cover."}],
        "projects": [{"projName": "Bonfire", "projDesc": "A social app for civil discussion. Made with Express, Node.js, MySQL, EJS and Bootstrap. Cloud MySQL solution provided by AWS Redis. Best viewed on mobile devices!"}, {"projName": "Travelr", "projDesc": "A social app that helps people make groups to share accommodation in big cities. Made with Bootstrap, Javascript and Firebase Store."}, {"projName": "Crate Smasher", "projDesc": "A casual game for Android. Every single asset in the game was hand-crafted by me! Made with Unity and C#."}, {"projName": "H-mart", "projDesc": "A blockchain project based on Hedera's Javascript API. Won a prize on MLH StormHacks2022!"}, {"projName": "Chris: The Game", "projDesc": "A comical trivia game made with Node.js and React. Won a prize on BCIT Hack The Break 2022!"}],
        "places": [{"country": "Canada", "lat": 45.421532, "long": -75.697189}, {"country": "Argentina", "lat": -34.603683, "long": -58.381557}, {"country": "Mexico", "lat": 19.432608, "long": -99.133209}, {"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Brazil", "lat": -15.793889, "long": -47.882778}, {"country": "Panama", "lat": 8.983333, "long": -79.516670}, {"country": "Dominican Republic", "lat": 18.483402, "long": -69.929611}, {"country": "Jamaica", "lat": 18.017874, "long": -76.809904}, {"country": "Paraguay", "lat": -25.263740, "long": -57.575926}, {"country": "UK", "lat": 51.509865, "long": -0.118092}, {"country": "France", "lat": 48.864716, "long": 2.349014}, {"country": "Spain", "lat": 40.416775, "long": -3.703790}],
        "links": [{"urlName": "linkedin", "url": "https://www.linkedin.com/in/jescalada"}, {"urlName": "github", "url": "https://github.com/jescalada"}]
    },
    "hanna": {
        "color": "Hanna",
        "name": "Hanna Gersten",
        "about": "I am an aspiring software engineer who loves to learn about different aspects of the coding industry.I am passionate about development and deployment of web applications as well as providing continuous delivery of software products.",
        "hobbies": [{"hobbyName": "traveling", "hobbyDesc": "Travelling helps me connect with new people, explore other cultures, and get outside of my comfort zone. Nature’s beauty has always attracted me, so I love traveling to new places to enjoy natural beauty at its best."}, {"hobbyName": "cooking", "hobbyDesc": "I love creating my own recipes and making food that others can enjoy. I find foods from other cultures to be fascinating and try to incorporate different methods into my own recipes."}, {"hobbyName": "reading", "hobbyDesc": "'Reading is to the mind what exercise is to the body.' Joseph Addison. Reading helps develop my mind and improves my writing and communication skills; while enjoying a good mystery book I can simultaneously develop my pattern recognition and problem solving abilities."}, {"hobbyName": "coding", "hobbyDesc": "I love creating; coding gives me the ability to do just that. The sense of accomplishment I receive from solving complex problems, creating my own website, or designing a new feature is irreplaceable."}, {"hobbyName": "dancing", "hobbyDesc": "Dancing fills me with energy and connects my mind to my body. I love recognizing the patterns in a song, making my body conform to those patterns, and losing myself to the beat. When I dance I feel strong, free, and alive."}],
        "experience": [{"expName": "Production Engineer Fellow, MLH Fellowship", "expDesc": "Contributing to real world problems to make sure services are reliable and scalable"}, {"expName": "NYU Tandon School of Engineering Bridge Program, July 2021 - December 2021", "expDesc": "Learned the foundations of C++, Data Structures and Algorithms, Operating Systems, and Networking"}, {"expName": "NYU Tandon School of Engineering, Brooklyn NY", "expDesc": "Expected Graduation: December, 2023 M.S. Computer Science"}],
        "projects": [{"projName": "Strace", "projDesc": "Designed a version of the linux strace command in xV6 as an Operating Systems project in C and supported commands such as strace run, strace dump, and flags.", "projUrl": "https://github.com/Hgersten-hash/Strace"}, {"projName": "QA Forum", "projDesc": "Q&A Forum written primarily in PHP and HTML (using the Bootstrap library) to support a local relational database.", "projUrl": "https://github.com/Hgersten-hash/QAForum"}, {"projName": "Weather App", "projDesc": "Designed a weather app in Vanilla Javascript that implements the OpenWeather API, Geolocation, and AJAX to display the current weather in any city.", "projUrl": "https://github.com/Hgersten-hash/MyAwesomeWeatherApp"}],
        "places": [{"country": "Rome", "lat": 41.902782, "long": 12.496366}, {"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Japan", "lat": 35.652832, "long": 139.839478}, {"country": "Israel", "lat": 31.771959, "long": 35.217018}, {"country": "Cancun", "lat": 21.17429, "long": -86.84656}, {"country": "Bermuda", "lat": 32.299507, "long": -64.790337}],
        "links": [{"urlName": "linkedin", "url": "http://linkedin.com/in/hannagersten"}, {"urlName": "github", "url": "http://github.com/Hgersten-hash"}]
    },
    "emily": {
        "color": "Emily",
        "name": "Emily Lim",
        "about": "Hello! My name is Emily and I'm a rising senior studying Computer Science at Washington State University Vancouver. I'm currently an MLH Fellow on the Production Engineering track this summer. I became interested in this industry after taking AP Computer Science classes in high school and solving problems with code. I'm passionate about learning and exploring various topics within tech.",
        "hobbies": [{"hobbyName": "Listening to music", "hobbyDesc": "I love exploring various genres and finding new artists. My favorite genres are kpop, pop, and alternative!"}, {"hobbyName": "Riding my bicycle", "hobbyDesc": "WSU Vancouver has a beautiful campus with a view of Mt. St. Helens and lots of trails. I love riding my bike and taking walks around the area!"}, {"hobbyName": "Starting DIY projects", "hobbyDesc": "From painting mini canvases to knitting beanies, I love learning how to create things."}],
        "experience": [{"expName": "MLH Production Engineering Fellow", "expDesc": "12-week program powered by Meta. Fellows learn the skills of Production / Site Reliability Engineering and DevOps while collaborating in pods and gaining professional skills from industry experts."}, {"expName": "Washington State University Vancouver", "expDesc": "Bachelors of Science in Computer Science. Expected graduation: May 2023."}],
        "projects": [{"projName": "Karo: Social Media Website", "projDesc": "Collaborated in a team to create a social media website with various features using React, JavaScript, HTMl, and CSS. Worked on a chatbox feature to send messages between two users with Socket.io."}, {"projName": "Community Engagement: Web Development", "projDesc": "Collaborated in a team to research best development practices for Future of Code’s website. Took the role of Senior Editor to compile and revise major deliverables, including a white paper, pitch deck, and poster."}, {"projName": "Minesweeper", "projDesc": "Wrote a Qt application in Python using the MVC design pattern to simulate Minesweeper."}, {"projName": "Connect4", "projDesc": "Integrated Python code with Tkinter GUI to create an interactive interface for Connect 4."}],
        "places": [{"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Canada", "lat": 45.421532, "long": -75.697189}],
        "links": [{"urlName": "linkedin", "url": "https://www.linkedin.com/in/emilyllim/"}, {"urlName": "github", "url": "https://github.com/emilyllim"}]
    },
    "emilie": {
        "color": "Emilie",
        "name": "Emilie Zhang",
        "about": "I am a student majoring in Software Engineering, minoring in Finance and I enjoy combining my creative and technical skills to make great things happen! I think my interest in technology started back when I was first given a Nintendo DS to play with. At the time, it was all fun and games. However, my initial interest in video games grew exponentially. I think it definitely pushed me to spend my free time learning as much as I could about technology.",
        "hobbies": [{"hobbyName": "drawing", "hobbyDesc": "I have been interested in the traditional arts since my very first art class in elementary school. There’s something about creating vivid images on paper that’s always been satisfying to me."}, {"hobbyName": "piano", "hobbyDesc": "Music brings people together. My family is very music-oriented and I really enjoy playing the piano for them."}, {"hobbyName": "journaling", "hobbyDesc": "I like to jot down the small things that happen in everyday life and reflect on them later on. I think it is a nice way to treasure some memories."}, {"hobbyName": "sightseeing", "hobbyDesc": "Whether it be hiking up a mountain, going on a walk through the forest or lounging by the beach, I like to view the world in different ways."}],
        "experience": [{"expName": "MLH Fellowship: Production Engineering track", "expDesc": "Curriculum with a focus in linux fundamentals, databases, networking and scripting"}, {"expName": "McGill University, B.Sc. Major Software Engineering", "expDesc": "Coursework include Fundamentals of programming, Introduction to Software Systems, and Introduction to Computer Science."}],
        "projects": [{"projName": "RAG Website", "projDesc": "A website for the Reader’s Advisory Group, a youth literature group at my local library. I designed the entire frontend of the website from scratch using HTML/CSS and Javascript. Many multimedia components were implemented and designs were customized with Adobe Photoshop."}, {"projName": "Cyber_Space", "projDesc": "A website to promote cybersecurity, it features fill-in interactive stories. Technical tools used were Flask, HTML/CSS, bootstrap"}, {"projName": "UYOGA", "projDesc": "A website to promote a chain of wellness for Yoga enthusiasts. My team implemented a deep learning model using tensorflow which accurately identifies a variety of yoga poses. Other technical tools used were the web framework Flask and Twilio’s messaging API."}, {"projName": "Mastermind Game", "projDesc": "A java game similar to Mastermind coded using java. It is an interactive color-guessing puzzle that actively responds to the player’s inputs."}],
        "places": [{"country": "Canada", "lat": 45.421532, "long": -75.697189}, {"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "China", "lat": 39.916668, "long": 116.383331}],
        "links": [{"urlName": "github", "url": "https://github.com/EmilieYZhang"}]
    }
}
