{
    "hanna": {
        "color": "Hanna",
        "name": "Hanna Gersten",
        "about": "I am an aspiring software engineer who loves to learn about different aspects of the coding industry. I am passionate about development and deployment of web applications as well as providing continuous delivery of software products.",
        "hobbies": [{"hobbyName": "traveling", "hobbyDesc": "Travelling helps me connect with new people, explore other cultures, and get outside of my comfort zone. Nature’s beauty has always attracted me, so I love traveling to new places to enjoy natural beauty at its best."}, {"hobbyName": "cooking", "hobbyDesc": "I love creating my own recipes and making food that others can enjoy. I find foods from other cultures to be fascinating and try to incorporate different methods into my own recipes."}, {"hobbyName": "reading", "hobbyDesc": "'Reading is to the mind what exercise is to the body.' Joseph Addison. Reading helps develop my mind and improves my writing and communication skills; while enjoying a good mystery book I can simultaneously develop my pattern recognition and problem solving abilities."}, {"hobbyName": "coding", "hobbyDesc": "I love creating; coding gives me the ability to do just that. The sense of accomplishment I receive from solving complex problems, creating my own website, or designing a new feature is irreplaceable."}, {"hobbyName": "dancing", "hobbyDesc": "Dancing fills me with energy and connects my mind to my body. I love recognizing the patterns in a song, making my body conform to those patterns, and losing myself to the beat. When I dance I feel strong, free, and alive."}],
        "experience": [{"expName": "Production Engineer Fellow, MLH Fellowship", "expDesc": "Contributing to real world problems to make sure services are reliable and scalable"}, {"expName": "NYU Tandon School of Engineering Bridge Program, July 2021 - December 2021", "expDesc": "Learned the foundations of C++, Data Structures and Algorithms, Operating Systems, and Networking"}, {"expName": "NYU Tandon School of Engineering, Brooklyn NY", "expDesc": "Expected Graduation: December, 2023 M.S. Computer Science"}],
        "awards": [{"awdName": "Certificate of Distinction", "awdDesc": "Bridge Program, NYU Tandon School of Engineering.", "awdUrl": "../static/pdfs/NYUCert.pdf"}, {"awdName": "Magna Cum Laude", "awdDesc": "CUNY Queens College, BA in Mathematics", "awdUrl": ""}, {"awdName": "Excellence in Mathematics Education", "awdDesc": "Awarded by CUNY Queens College SEYS-Mathematics Deparment", "awdjUrl": ""}],
        "places": [{"country": "Rome", "lat": 41.902782, "long": 12.496366}, {"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Japan", "lat": 35.652832, "long": 139.839478}, {"country": "Israel", "lat": 31.771959, "long": 35.217018}, {"country": "Cancun", "lat": 21.17429, "long": -86.84656}, {"country": "Bermuda", "lat": 32.299507, "long": -64.790337}],
        "links": [{"urlName": "linkedin", "url": "http://linkedin.com/in/hannagersten"}, {"urlName": "github", "url": "http://github.com/Hgersten-hash"}]
    }
}
