{
    "emily": {
        "color": "Emily",
        "name": "Emily Lim",
        "about": "Hello! My name is Emily and I'm a rising senior studying Computer Science at Washington State University Vancouver. I'm currently an MLH Fellow on the Production Engineering track this summer. I became interested in this industry after taking AP Computer Science classes in high school and solving problems with code. I'm passionate about learning and exploring various topics within tech.",
        "hobbies": [{"hobbyName": "Listening to music", "hobbyDesc": "I love exploring various genres and finding new artists. My favorite genres are kpop, pop, and alternative!"}, {"hobbyName": "Riding my bicycle", "hobbyDesc": "WSU Vancouver has a beautiful campus with a view of Mt. St. Helens and lots of trails. I love riding my bike and taking walks around the area!"}, {"hobbyName": "Starting DIY projects", "hobbyDesc": "From painting mini canvases to knitting beanies, I love learning how to create things."}],
        "experience": [{"expName": "MLH Production Engineering Fellow", "expDesc": "12-week program powered by Meta. Fellows learn the skills of Production / Site Reliability Engineering and DevOps while collaborating in pods and gaining professional skills from industry experts."}, {"expName": "Washington State University Vancouver", "expDesc": "Bachelors of Science in Computer Science. Expected graduation: May 2023."}],
        "projects": [{"projName": "Karo: Social Media Website", "projDesc": "Collaborated in a team to create a social media website with various features using React, JavaScript, HTML, and CSS. Worked on a chatbox feature to send messages between two users with Socket.io."}, {"projName": "Community Engagement: Web Development", "projDesc": "Collaborated in a team to research best development practices for Future of Code’s website. Took the role of Senior Editor to compile and revise major deliverables, including a white paper, pitch deck, and poster."}, {"projName": "Minesweeper", "projDesc": "Wrote a Qt application in Python using the MVC design pattern to simulate Minesweeper."}, {"projName": "Connect4", "projDesc": "Integrated Python code with Tkinter GUI to create an interactive interface for Connect 4."}, {"projName": "Portfolio: Team Pythonic", "projDesc": "Worked in a team to create a reusable, scalable, and mobile-friendly portfolio template. Can be as a personal portfolio or a team portfolio. Winner of the 22.SUM.21 pod during the MLH Fellowship Orientation Hackathon."}],
        "places": [{"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Canada", "lat": 45.421532, "long": -75.697189}],
        "links": [{"urlName": "linkedin", "url": "https://www.linkedin.com/in/emilyllim/"}, {"urlName": "github", "url": "https://github.com/emilyllim"}]
    }
}
